age = int(input("سلام! \n این برنامه میتواند به صورت تقریبی به تشخیص بیماری شما کمک کند. \n لطفا سن خود را وارد کنید. : "))
print()

gender = int(input("حالا جنسیت خود را انتخاب کنید.:\n **برای اطمینان از کارایی این برنامه، \n لطفا توجه داشته باشید که فقط از اعداد به عنوان ورودی استفاده کنید.** \n 1.زن \n 2.مرد\n"))
print()

symptom =int(input("لطفا علامت بارز بیماری خود را انتخاب کند. \n 1. شکم درد \n 2. درد قفسه ی سینه \n 3. سرفه \n 4. کمر درد \n 5. تنگی نفس \n"))
print()


if symptom == 2:
    AreaOfThePain = int(input("بیشتر در کدام قسمت درد را احساس می کنید؟ \n 1. پشت جناغ \n 2. زیر پستان چپ \n 3. در طول غضروف دنده ای \n"))
    print()
   
    if AreaOfThePain == 1:
        BackPainCheck = int(input("آیا درد شما به پشت نیز منتشر شده است؟ \n 1. بله \n 2. خیر، درد اغلب به مثانه ها، \n بازوها، گردن، فک تحتانی یا قسمت فوقانی شکم منتشر می شود. \n 3. گزینه های دیگر\n"))
        print()

        if BackPainCheck == 2:
           IntensityBladderPainCheck = int(input("شدت درد شما چقدر است؟ \n 1.خفیف \n 2.متوسط \n 3.شدید\n"))
           print()
           if IntensityBladderPainCheck == 1:
               associated_symptoms = int(input("علائم همراه خود را انتخاب کنید. \n 1.تنگی نفس \n 2.تهوع \n 3.تنگس نفس و تهوع \n 4.گزینه های دیگر\n"))
               if associated_symptoms == 1:
                   print("شما با احتمال 25% به بیماری آنژین صدری مبتلا هستید. \n اما برای نتایج دقیق تر، \n توصیه می شود به پزشک مراجعه کنید.")
                   print()
                   print("زمان بندی آن: \n معمولا 1 تا 3 دقیقه \n **عوامل تشدید کننده ی آن: \n اغلب فعالیت، به خصوص هوای سرد، غذا خوردن و استرس عاطفی** \n **عوامل تخفیف دهنده ی آن: \n اغلب استراحت و استفاده از نیتروگلیسیرین**")
                   print()
                   print("از نیتروگلیسیرین استفاده کنید ولی برای نتایج دقیق تر، \n پیشنهاد می شود که به پزشک مراجعه کنید.")
               elif associated_symptoms == 2:
                    print("شما با احتمال 20% به بیماری آنژین صدری مبتلا هستید. \n اما برای نتایج دقیق تر، \n توصیه می شود به پزشک مراجعه کنید.")
                    print()
                    print("زمان بندی آن: \n معمولا 1 تا 3 دقیقه \n **عوامل تشدید کننده ی آن: \n اغلب فعالیت، به خصوص هوای سرد، غذا خوردن و استرس عاطفی** \n **عوامل تخفیف دهنده ی آن: \n اغلب استراحت و استفاده از نیتروگلیسیرین**")
                    print()
                    print("از نیتروگلیسیرین استفاده کنید ولی برای نتایج دقیق تر، \n پیشنهاد می شود که به پزشک مراجعه کنید.")
               elif associated_symptoms == 3:
                      print("شما با احتمال 30% به بیماری آنژین صدری مبتلا هستید. \n اما برای نتایج دقیق تر، \n توصیه می شود به پزشک مراجعه کنید.")
                      print()
                      print("زمان بندی آن: \n معمولا 1 تا 3 دقیقه \n **عوامل تشدید کننده ی آن: \n اغلب فعالیت، به خصوص هوای سرد، غذا خوردن و استرس عاطفی** \n **عوامل تخفیف دهنده ی آن: \n اغلب استراحت و استفاده از نیتروگلیسیرین**")
                      print()
                      print("از نیتروگلیسیرین استفاده کنید ولی برای نتایج دقیق تر، \n پیشنهاد می شود که به پزشک مراجعه کنید.")
               else:
                   print("متاسفیم، اطلاعات کافی برای تشخیص مشکل شما در دسترس نیست. \n لطفا به پزشک خود مراجعه کنید.")
                    
                
           elif IntensityBladderPainCheck == 2:
               associated_symptoms = int(input("علائم همراه خود را انتخاب کنید. \n 1.تنگی نفس \n 2.تهوع \n 3.تنگس نفس و تهوع \n 4.گزینه های دیگر\n"))
               if associated_symptoms == 1: 
                   print("شما با احتمال 40%-50% به بیماری آنژین صدری مبتلا هستید. \n اما برای نتایج دقیق تر، \n توصیه می شود به پزشک مراجعه کنید.")
                   print()
                   print("زمان بندی آن: \n معمولا 1 تا 3 دقیقه \n **عوامل تشدید کننده ی آن: \n اغلب فعالیت، به خصوص هوای سرد، غذا خوردن و استرس عاطفی** \n **عوامل تخفیف دهنده ی آن: \n اغلب استراحت و استفاده از نیتروگلیسیرین**")
                   print()
                   print("از نیتروگلیسیرین استفاده کنید ولی برای نتایج دقیق تر، \n پیشنهاد می شود که به پزشک مراجعه کنید.")
               elif associated_symptoms == 2:
                   print("شما با احتمال 45%-35% به بیماری آنژین صدری مبتلا هستید. \n اما برای نتایج دقیق تر، \n توصیه می شود به پزشک مراجعه کنید.")
                   print()
                   print("زمان بندی آن: \n معمولا 1 تا 3 دقیقه \n **عوامل تشدید کننده ی آن: \n اغلب فعالیت، به خصوص هوای سرد، غذا خوردن و استرس عاطفی** \n **عوامل تخفیف دهنده ی آن: \n اغلب استراحت و استفاده از نیتروگلیسیرین**")
                   print()
                   print("از نیتروگلیسیرین استفاده کنید ولی برای نتایج دقیق تر، \n پیشنهاد می شود که به پزشک مراجعه کنید.")
               elif associated_symptoms == 3:
                   print("شما با احتمال 60%-50% به بیماری آنژین صدری مبتلا هستید. \n اما برای نتایج دقیق تر، \n توصیه می شود به پزشک مراجعه کنید.")
                   print()
                   print("زمان بندی آن: \n معمولا 1 تا 3 دقیقه \n **عوامل تشدید کننده ی آن: \n اغلب فعالیت، به خصوص هوای سرد، غذا خوردن و استرس عاطفی** \n **عوامل تخفیف دهنده ی آن: \n اغلب استراحت و استفاده از نیتروگلیسیرین**")
                   print()
                   print("از نیتروگلیسیرین استفاده کنید ولی برای نتایج دقیق تر، \n پیشنهاد می شود که به پزشک مراجعه کنید.")
               elif associated_symptoms == 4:
                   print("متاسفیم، اطلاعات کافی برای تشخیص بیماری شما در دسترس نیست. \n لطفا به پزشک خود مراجعه کنید.")
                    
           elif IntensityBladderPainCheck == 3:
               associated_symptoms = int(input("علائم همراه خود را انتخاب کنید. \n 1.تنگی نفس \n 2.تهوع \n 3.تنگس نفس و تهوع \n 4.گزینه های دیگر\n"))
               if associated_symptoms == 1: 
                   print("شما با احتمال 80%-70% به بیماری سکته ی قلبی مبتلا هستید. \n اما برای نتایج دقیق تر، \n توصیه می شود به پزشک مراجعه کنید.")
                   print()
                   print("زمان بندی آن: 20 دقیقه تا چند ساعت \n **فعالیت همیشه باعث بدتر شدن این بیماری نمی شود.** \n **این بیماری با استراحت بهبود نمی یابد.**")
                   print()
                   print("از نیتروگلیسیرین استفاده کنید \n و سپس خیلی سریع آنژیوگرافی انجام دهید.")
               elif associated_symptoms == 2:
                   print("شما با احتمال 75%-65% به بیماری سکته ی قلبی مبتلا هستید. \n اما برای نتایج دقیق تر، \n توصیه می شود به پزشک مراجعه کنید.")
                   print()
                   print("زمان بندی آن: 20 دقیقه تا چند ساعت \n **فعالیت همیشه باعث بدتر شدن این بیماری نمی شود.** \n **این بیماری با استراحت بهبود نمی یابد.**")
                   print()
                   print("از نیتروگلیسیرین استفاده کنید \n و سپس خیلی سریع آنژیوگرافی انجام دهید.")
               elif associated_symptoms == 3:
                   print("شما با احتمال 90%-80% به بیماری سکته ی قلبی مبتلا هستید. \n اما برای نتایج دقیق تر، \n توصیه می شود به پزشک مراجعه کنید.")
                   print()
                   print("زمان بندی آن: 20 دقیقه تا چند ساعت \n **فعالیت همیشه باعث بدتر شدن این بیماری نمی شود.** \n **این بیماری با استراحت بهبود نمی یابد.**")
                   print()
                   print("از نیتروگلیسیرین استفاده کنید \n و سپس خیلی سریع آنژیوگرافی انجام دهید.")
               elif associated_symptoms == 4:
                   print("متاسفیم، اطلاعات کافی برای تشخیص مشکل شما در دسترس نیست. \n لطفا به پزشک خود مراجعه کنید.")
          
        elif BackPainCheck == 1:
            QualityBackPainCheck = int(input("کیفیت درد شما به چه صورت است؟ \n 1.سوزاننده \n 2.سوزاننده و فشارنده \n 3.گزینه های دیگر\n"))
            if QualityBackPainCheck == 1:
                IntensityBackPainCheck = int(input("شدت درد شما به چه صورت است؟ \n 1.متوسط \n 2.شدید\n"))
                if IntensityBackPainCheck == 1:
                    Cough = int(input("آیا سرفه می کنید؟ \n 1.بله \n 2.خیر\n"))
                    if Cough == 1:
                        print("شما به احتمال 40% به بیماری رفلاکس معده به مری مبتلا هستید. \n ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                        print()
                        print("زمان بندی آن: متغیر \n **عوامل تشدید کننده ی آن: \n معده ی غذایی بزگ، خم شدن و دراز کشیدن** \n **عوامل تخفیف دهنده ی آن: \n آنتی اسید ها و گاهی آروغ زدن**")
                        print()
                        print("از اوموپرازول استفاده کنید \n و اگر شدید شد، پنتاپرازول تزریق کنید.")
                    elif Cough == 2:
                        print("شما به احتمال 35% به بیماری رفلاکس معده به مری مبتلا هستید. \n ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                        print()
                        print("زمان بندی آن: متغیر \n **عوامل تشدید کننده ی آن: \n معده ی غذایی بزگ، خم شدن و دراز کشیدن** \n **عوامل تخفیف دهنده ی آن: \n آنتی اسید ها و گاهی آروغ زدن**")
                        print()
                        print("از اوموپرازول استفاده کنید \n و اگر شدید شد، پنتاپرازول تزریق کنید.")
                elif IntensityBackPainCheck == 2:
                    Cough = int(input("آیا سرفه می کنید؟ \n 1.بله \n 2.خیر\n"))
                    if Cough == 1:
                        print("شما به احتمال 60% به بیماری رفلاکس معده به مری مبتلا هستید. \n ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                        print()
                        print("زمان بندی آن: متغیر \n **عوامل تشدید کننده ی آن: \n معده ی غذایی بزگ، خم شدن و دراز کشیدن** \n **عوامل تخفیف دهنده ی آن: \n آنتی اسید ها و گاهی آروغ زدن**")
                        print()
                        print("از اوموپرازول استفاده کنید \n و اگر شدید شد، پنتاپرازول تزریق کنید.")
                    elif Cough == 2:
                        print("شما به احتمال 50% به بیماری رفلاکس معده به مری مبتلا هستید. \n ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                        print()
                        print("زمان بندی آن: متغیر \n **عوامل تشدید کننده ی آن: \n معده ی غذایی بزگ، خم شدن و دراز کشیدن** \n **عوامل تخفیف دهنده ی آن: \n آنتی اسید ها و گاهی آروغ زدن**")
                        print()
                        print("از اوموپرازول استفاده کنید \n و اگر شدید شد، پنتاپرازول تزریق کنید.")
            
            elif QualityBackPainCheck == 2:
                IntensityBackPainCheck = int(input("شدت درد شما به چه صورت است؟ \n 1.متوسط \n 2.شدید\n"))
                if IntensityBackPainCheck == 1:
                    Cough = int(input("آیا سرفه می کنید؟ \n 1.بله \n 2.خیر\n"))
                    if Cough == 1:
                        print("شما به احتمال 45% به بیماری رفلاکس معده به مری مبتلا هستید. \n ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                        print()
                        print("زمان بندی آن: متغیر \n **عوامل تشدید کننده ی آن: \n معده ی غذایی بزگ، خم شدن و دراز کشیدن** \n **عوامل تخفیف دهنده ی آن: \n آنتی اسید ها و گاهی آروغ زدن**")
                        print()
                        print("از اوموپرازول استفاده کنید \n و اگر شدید شد، پنتاپرازول تزریق کنید.")
                    elif Cough == 2:
                        print("شما به احتمال 40% به بیماری رفلاکس معده به مری مبتلا هستید. \n ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                        print()
                        print("زمان بندی آن: متغیر \n **عوامل تشدید کننده ی آن: \n معده ی غذایی بزگ، خم شدن و دراز کشیدن** \n **عوامل تخفیف دهنده ی آن: \n آنتی اسید ها و گاهی آروغ زدن**")
                        print()
                        print("از اوموپرازول استفاده کنید \n و اگر شدید شد، پنتاپرازول تزریق کنید.")
                elif IntensityBackPainCheck == 2:
                    Cough = int(input("آیا سرفه می کنید؟ \n 1.بله \n 2.خیر\n"))
                    if Cough == 1:
                        print("شما به احتمال 65% به بیماری رفلاکس معده به مری مبتلا هستید. \n ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                        print()
                        print("زمان بندی آن: متغیر \n **عوامل تشدید کننده ی آن: \n معده ی غذایی بزگ، خم شدن و دراز کشیدن** \n **عوامل تخفیف دهنده ی آن: \n آنتی اسید ها و گاهی آروغ زدن**")
                        print()
                        print("از اوموپرازول استفاده کنید \n و اگر شدید شد، پنتاپرازول تزریق کنید.")
                    elif Cough == 2:
                        print("شما به احتمال 55% به بیماری رفلاکس معده به مری مبتلا هستید. \n ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                        print()
                        print("زمان بندی آن: متغیر \n **عوامل تشدید کننده ی آن: \n معده ی غذایی بزگ، خم شدن و دراز کشیدن** \n **عوامل تخفیف دهنده ی آن: \n آنتی اسید ها و گاهی آروغ زدن**")
                        print()
                        print("از اوموپرازول استفاده کنید \n و اگر شدید شد، پنتاپرازول تزریق کنید.")     
         
            elif QualityBackPainCheck == 3:
                print("متاسفیم، اطلاعات کافی برای تشخیص مشکل شما در دسترس نیست. \n لطفا به پزشک خود مراجعه کنید.")
         
        elif BackPainCheck == 3:
            print("متاسفیم، اطلاعات کافی برای تشخیص مشکل شما در دسترس نیست. \n لطفا به پزشک خود مراجعه کنید.")
     
          
              
                
           
                
         
    elif AreaOfThePain == 3:
        QualityCheck = int(input("آیا کیفیت درد شما تیز، مبهم و بی تاب کننده است؟ \n 1.بله \n 2.خیر \n"))
        if QualityCheck == 1:
            SensitivityCheck = int(input("آیا شما به لمس موضعی حسایت دارید؟ \n 1.بله \n 2.خیر \n"))
            if SensitivityCheck == 1:
                print("شما با احتمال 70%-80% به درد دیواره ی قفسه سینه مبتلا هستید. \n ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                print()
                print("زمان بندی آن: ساعت ها تا روز ها \n **عوامل تشدید کننده ی آن: \n سرفه، حرکات قفسه سینه و دست ها**")
                print()
                print("اگر دیواره ی قفسه سینه ی شما شکسته باشد؛ \n باید صبر و استراحت کنید. \n اگر نشکسته باشد؛ باید صبر کنید تا کبودی رفع شود.")
             
            elif SensitivityCheck == 2:
                print("شما با احتمال 60%-50% به درد دیواره ی قفسه سینه مبتلا هستید. \n ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                print()
                print("زمان بندی آن: ساعت ها تا روز ها \n **عوامل تشدید کننده ی آن: \n سرفه، حرکات قفسه سینه و دست ها**")
                print()
                print("اگر دیواره ی قفسه سینه ی شما شکسته باشد؛ \n باید صبر و استراحت کنید. \n اگر نشکسته باشد؛ باید صبر کنید تا کبودی رفع شود.")
                
        elif QualityCheck == 2:
            print("متاسفیم، اطلاعات کافی برای تشخیص مشکل شما در دسترس نیست. \n لطفا به پزشک خود مراجعه کنید.")
          
    elif AreaOfThePain == 2:
        PainInTheFrontCheck = int(input("آیا روی قدام سینه ی خود، درد احساس می کنید؟ \n 1.بله \n 2.خیر \n"))
        if PainInTheFrontCheck == 2:
            QualityFrontCheck = int(input("آیا کیفیت درد شما تیز، مبهم و بی تاب کننده است؟ \n 1.بله \n 2.خیر \n"))
            if QualityFrontCheck == 1:
                SensitivityFrontCheck = int(input("آیا شما به لمس موضعی حسایت دارید؟ \n 1.بله \n 2.خیر \n"))
                if SensitivityFrontCheck == 1:
                    print("شما با احتمال 70%-60% به درد دیواره ی قفسه سینه مبتلا هستید. \n ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                    print()
                    print("زمان بندی آن: ساعت ها تا روز ها \n **عوامل تشدید کننده ی آن: \n سرفه، حرکات قفسه سینه و دست ها**")
                    print()
                    print("اگر دیواره ی قفسه سینه ی شما شکسته باشد؛ \n باید صبر و استراحت کنید. \n اگر نشکسته باشد؛ باید صبر کنید تا کبودی رفع شود.")
                 
                elif SensitivityFrontCheck == 2:
                    print("شما با احتمال 60%-50% به درد دیواره ی قفسه سینه مبتلا هستید. \n ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                    print()
                    print("زمان بندی آن: ساعت ها تا روز ها \n **عوامل تشدید کننده ی آن: \n سرفه، حرکات قفسه سینه و دست ها**")
                    print()
                    print("اگر دیواره ی قفسه سینه ی شما شکسته باشد؛ \n باید صبر و استراحت کنید. \n اگر نشکسته باشد؛ باید صبر کنید تا کبودی رفع شود.")
            
            elif QualityFrontCheck == 2:
                print("متاسفیم، اطلاعات کافی برای تشخیص مشکل شما در دسترس نیست. \n لطفا به پزشک خود مراجعه کنید.")
                
        elif PainInTheFrontCheck == 1:
            QualityFrontCheck2 = int(input("آیا کیفیت درد شما تیز، مبهم و بی تاب کننده است؟ \n 1.بله \n 2.خیر \n"))
            if QualityFrontCheck2 == 1:
                print("حال باید بفهمیم شما چه علائم همراهی دارید.")
                print(" 1.تنگی نفس \n 2.تپش قلب ضعیف \n 3.اضطراب \n 4.گزینه های دیگر")
                print()
                associated_symptoms=input("کدام یک ار علائم همراه را دارید؟ \n شما میتوانید چند گزینه هم انتخاب کنید. /n فقط کافی است بین اعداد  ,  قرار دهید.\n")
                print()
                associated_symptoms=set(map(int,associated_symptoms.split(",")))
                if associated_symptoms == {1}:
                    print("شما به احتمال 40% به اضطراب و اخلالات روانی مبتلا هستید. \n  ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                    print()
                    print("زمان بندی آن: ساعت ها تا روز ها \n **عوامل تشدید کننده ی آن: فعالیت و استرس عاطفی**")
                    print()
                    print("به روان پزشک مراجعه کرده و در صورت نیاز داروی اعصاب مصرف کنید.")
                elif associated_symptoms == {2}:
                    print("شما به احتمال 35% به اضطراب و اخلالات روانی مبتلا هستید. \n  ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                    print()
                    print("زمان بندی آن: ساعت ها تا روز ها \n **عوامل تشدید کننده ی آن: فعالیت و استرس عاطفی**")
                    print()
                    print("به روان پزشک مراجعه کرده و در صورت نیاز داروی اعصاب مصرف کنید.")
                elif associated_symptoms == {3}:
                    print("شما به احتمال 50% به اضطراب و اخلالات روانی مبتلا هستید. \n  ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                    print()
                    print("زمان بندی آن: ساعت ها تا روز ها \n **عوامل تشدید کننده ی آن: فعالیت و استرس عاطفی**")
                    print()
                    print("به روان پزشک مراجعه کرده و در صورت نیاز داروی اعصاب مصرف کنید.")
                elif associated_symptoms == {1,2}:
                    print("شما به احتمال 45% به اضطراب و اخلالات روانی مبتلا هستید. \n  ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                    print()
                    print("زمان بندی آن: ساعت ها تا روز ها \n **عوامل تشدید کننده ی آن: فعالیت و استرس عاطفی**")
                    print()
                    print("به روان پزشک مراجعه کرده و در صورت نیاز داروی اعصاب مصرف کنید.")
                elif associated_symptoms == {1,3}:
                    print("شما به احتمال 55% به اضطراب و اخلالات روانی مبتلا هستید. \n  ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                    print()
                    print("زمان بندی آن: ساعت ها تا روز ها \n **عوامل تشدید کننده ی آن: فعالیت و استرس عاطفی**")
                    print()
                    print("به روان پزشک مراجعه کرده و در صورت نیاز داروی اعصاب مصرف کنید.")
                elif associated_symptoms == {2,3}:
                    print("شما به احتمال 50% به اضطراب و اخلالات روانی مبتلا هستید. \n  ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                    print()
                    print("زمان بندی آن: ساعت ها تا روز ها \n **عوامل تشدید کننده ی آن: فعالیت و استرس عاطفی**")
                    print()
                    print("به روان پزشک مراجعه کرده و در صورت نیاز داروی اعصاب مصرف کنید.")
                elif associated_symptoms == {1,2,3}:
                    print("شما به احتمال 60%-70% به اضطراب و اخلالات روانی مبتلا هستید. \n  ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                    print()
                    print("زمان بندی آن: ساعت ها تا روز ها \n **عوامل تشدید کننده ی آن: فعالیت و استرس عاطفی**")
                    print()
                    print("به روان پزشک مراجعه کرده و در صورت نیاز داروی اعصاب مصرف کنید.")
                elif associated_symptoms == {4}:
                    print("متاسفیم، اطلاعات کافی برای تشخیص مشکل شما در دسترس نیست. \n لطفا به پزشک خود مراجعه کنید.")
                    
                     
                     
            elif QualityFrontCheck2 == 2:
                print("متاسفیم، اطلاعات کافی برای تشخیص مشکل شما در دسترس نیست. \n لطفا به پزشک خود مراجعه کنید.")
                
                
                
                
                
                
                
                
                
                
                
                
                
                
                
                
                