age=int(input("چند سال دارید؟"))
gender=int(input("جنسیت خود را وارد کنید.اگر خانم هستید عدد 1 و اگر آقا هستید عدد 2 را وارد کنید."))
#حالا باید از کاربر بپرسیم که علامت اصلی ای که دچارش است کدام است؟
print("سلام،ما در این برنامه می خواهیم تا تشخیص اولیه از بیماری شما داشته باشیم و به شما راهکار پیشنهاد بدهیم.")
print()
print("این برنامه در حال حاضر روی 5 علامت اصلی بیماری ها کار می کند:")
Main_symptoms = ("درد شکم", "درد قفسه سینه", "سرفه", "درد کمر", "تنگی نفس")

print("1=درد شکم\n2=درد قفسه سینه\n3=سرفه\n4=درد کمر\n5=تنگی نفس")
A = int(input("لطفا به من بگو کدام یک از علامت های اصلی زیر را داری؟ "))

if A == 1:
    print("شما شکم درد دارید.")
###################################################    
elif A == 2:
    print("شما درد قفسه سینه دارید.")
    AreaOfThePain = int(input("بیشتر در کدام قسمت درد را احساس می کنید؟ \n 1. پشت جناغ \n 2. زیر پستان چپ \n 3. در طول غضروف دنده ای \n"))
    print()
   
    if AreaOfThePain == 1:
        BackPainCheck = int(input("آیا درد شما به پشت نیز منتشر شده است؟ \n 1. بله \n 2. خیر، درد اغلب به مثانه ها، \n بازوها، گردن، فک تحتانی یا قسمت فوقانی شکم منتشر می شود. \n 3. گزینه های دیگر\n"))
        print()

        if BackPainCheck == 2:
           IntensityBladderPainCheck = int(input("شدت درد شما چقدر است؟ \n 1.خفیف \n 2.متوسط \n 3.شدید\n"))
           print()
           if IntensityBladderPainCheck == 1:
               associated_symptoms = int(input("علائم همراه خود را انتخاب کنید. \n 1.تنگی نفس \n 2.تهوع \n 3.تنگس نفس و تهوع \n 4.گزینه های دیگر\n"))
               if associated_symptoms == 1:
                   print("شما با احتمال 25% به بیماری آنژین صدری مبتلا هستید. \n اما برای نتایج دقیق تر، \n توصیه می شود به پزشک مراجعه کنید.")
                   print()
                   print("زمان بندی آن: \n معمولا 1 تا 3 دقیقه \n **عوامل تشدید کننده ی آن: \n اغلب فعالیت، به خصوص هوای سرد، غذا خوردن و استرس عاطفی** \n **عوامل تخفیف دهنده ی آن: \n اغلب استراحت و استفاده از نیتروگلیسیرین**")
                   print()
                   print("از نیتروگلیسیرین استفاده کنید ولی برای نتایج دقیق تر، \n پیشنهاد می شود که به پزشک مراجعه کنید.")
               elif associated_symptoms == 2:
                    print("شما با احتمال 20% به بیماری آنژین صدری مبتلا هستید. \n اما برای نتایج دقیق تر، \n توصیه می شود به پزشک مراجعه کنید.")
                    print()
                    print("زمان بندی آن: \n معمولا 1 تا 3 دقیقه \n **عوامل تشدید کننده ی آن: \n اغلب فعالیت، به خصوص هوای سرد، غذا خوردن و استرس عاطفی** \n **عوامل تخفیف دهنده ی آن: \n اغلب استراحت و استفاده از نیتروگلیسیرین**")
                    print()
                    print("از نیتروگلیسیرین استفاده کنید ولی برای نتایج دقیق تر، \n پیشنهاد می شود که به پزشک مراجعه کنید.")
               elif associated_symptoms == 3:
                      print("شما با احتمال 30% به بیماری آنژین صدری مبتلا هستید. \n اما برای نتایج دقیق تر، \n توصیه می شود به پزشک مراجعه کنید.")
                      print()
                      print("زمان بندی آن: \n معمولا 1 تا 3 دقیقه \n **عوامل تشدید کننده ی آن: \n اغلب فعالیت، به خصوص هوای سرد، غذا خوردن و استرس عاطفی** \n **عوامل تخفیف دهنده ی آن: \n اغلب استراحت و استفاده از نیتروگلیسیرین**")
                      print()
                      print("از نیتروگلیسیرین استفاده کنید ولی برای نتایج دقیق تر، \n پیشنهاد می شود که به پزشک مراجعه کنید.")
               else:
                   print("متاسفیم، اطلاعات کافی برای تشخیص مشکل شما در دسترس نیست. \n لطفا به پزشک خود مراجعه کنید.")
                    
                
           elif IntensityBladderPainCheck == 2:
               associated_symptoms = int(input("علائم همراه خود را انتخاب کنید. \n 1.تنگی نفس \n 2.تهوع \n 3.تنگس نفس و تهوع \n 4.گزینه های دیگر\n"))
               if associated_symptoms == 1: 
                   print("شما با احتمال 40%-50% به بیماری آنژین صدری مبتلا هستید. \n اما برای نتایج دقیق تر، \n توصیه می شود به پزشک مراجعه کنید.")
                   print()
                   print("زمان بندی آن: \n معمولا 1 تا 3 دقیقه \n **عوامل تشدید کننده ی آن: \n اغلب فعالیت، به خصوص هوای سرد، غذا خوردن و استرس عاطفی** \n **عوامل تخفیف دهنده ی آن: \n اغلب استراحت و استفاده از نیتروگلیسیرین**")
                   print()
                   print("از نیتروگلیسیرین استفاده کنید ولی برای نتایج دقیق تر، \n پیشنهاد می شود که به پزشک مراجعه کنید.")
               elif associated_symptoms == 2:
                   print("شما با احتمال 45%-35% به بیماری آنژین صدری مبتلا هستید. \n اما برای نتایج دقیق تر، \n توصیه می شود به پزشک مراجعه کنید.")
                   print()
                   print("زمان بندی آن: \n معمولا 1 تا 3 دقیقه \n **عوامل تشدید کننده ی آن: \n اغلب فعالیت، به خصوص هوای سرد، غذا خوردن و استرس عاطفی** \n **عوامل تخفیف دهنده ی آن: \n اغلب استراحت و استفاده از نیتروگلیسیرین**")
                   print()
                   print("از نیتروگلیسیرین استفاده کنید ولی برای نتایج دقیق تر، \n پیشنهاد می شود که به پزشک مراجعه کنید.")
               elif associated_symptoms == 3:
                   print("شما با احتمال 60%-50% به بیماری آنژین صدری مبتلا هستید. \n اما برای نتایج دقیق تر، \n توصیه می شود به پزشک مراجعه کنید.")
                   print()
                   print("زمان بندی آن: \n معمولا 1 تا 3 دقیقه \n **عوامل تشدید کننده ی آن: \n اغلب فعالیت، به خصوص هوای سرد، غذا خوردن و استرس عاطفی** \n **عوامل تخفیف دهنده ی آن: \n اغلب استراحت و استفاده از نیتروگلیسیرین**")
                   print()
                   print("از نیتروگلیسیرین استفاده کنید ولی برای نتایج دقیق تر، \n پیشنهاد می شود که به پزشک مراجعه کنید.")
               elif associated_symptoms == 4:
                   print("متاسفیم، اطلاعات کافی برای تشخیص بیماری شما در دسترس نیست. \n لطفا به پزشک خود مراجعه کنید.")
                    
           elif IntensityBladderPainCheck == 3:
               associated_symptoms = int(input("علائم همراه خود را انتخاب کنید. \n 1.تنگی نفس \n 2.تهوع \n 3.تنگس نفس و تهوع \n 4.گزینه های دیگر\n"))
               if associated_symptoms == 1: 
                   print("شما با احتمال 80%-70% به بیماری سکته ی قلبی مبتلا هستید. \n اما برای نتایج دقیق تر، \n توصیه می شود به پزشک مراجعه کنید.")
                   print()
                   print("زمان بندی آن: 20 دقیقه تا چند ساعت \n **فعالیت همیشه باعث بدتر شدن این بیماری نمی شود.** \n **این بیماری با استراحت بهبود نمی یابد.**")
                   print()
                   print("از نیتروگلیسیرین استفاده کنید \n و سپس خیلی سریع آنژیوگرافی انجام دهید.")
               elif associated_symptoms == 2:
                   print("شما با احتمال 75%-65% به بیماری سکته ی قلبی مبتلا هستید. \n اما برای نتایج دقیق تر، \n توصیه می شود به پزشک مراجعه کنید.")
                   print()
                   print("زمان بندی آن: 20 دقیقه تا چند ساعت \n **فعالیت همیشه باعث بدتر شدن این بیماری نمی شود.** \n **این بیماری با استراحت بهبود نمی یابد.**")
                   print()
                   print("از نیتروگلیسیرین استفاده کنید \n و سپس خیلی سریع آنژیوگرافی انجام دهید.")
               elif associated_symptoms == 3:
                   print("شما با احتمال 90%-80% به بیماری سکته ی قلبی مبتلا هستید. \n اما برای نتایج دقیق تر، \n توصیه می شود به پزشک مراجعه کنید.")
                   print()
                   print("زمان بندی آن: 20 دقیقه تا چند ساعت \n **فعالیت همیشه باعث بدتر شدن این بیماری نمی شود.** \n **این بیماری با استراحت بهبود نمی یابد.**")
                   print()
                   print("از نیتروگلیسیرین استفاده کنید \n و سپس خیلی سریع آنژیوگرافی انجام دهید.")
               elif associated_symptoms == 4:
                   print("متاسفیم، اطلاعات کافی برای تشخیص مشکل شما در دسترس نیست. \n لطفا به پزشک خود مراجعه کنید.")
          
        elif BackPainCheck == 1:
            QualityBackPainCheck = int(input("کیفیت درد شما به چه صورت است؟ \n 1.سوزاننده \n 2.سوزاننده و فشارنده \n 3.گزینه های دیگر\n"))
            if QualityBackPainCheck == 1:
                IntensityBackPainCheck = int(input("شدت درد شما به چه صورت است؟ \n 1.متوسط \n 2.شدید\n"))
                if IntensityBackPainCheck == 1:
                    Cough = int(input("آیا سرفه می کنید؟ \n 1.بله \n 2.خیر\n"))
                    if Cough == 1:
                        print("شما به احتمال 40% به بیماری رفلاکس معده به مری مبتلا هستید. \n ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                        print()
                        print("زمان بندی آن: متغیر \n **عوامل تشدید کننده ی آن: \n معده ی غذایی بزگ، خم شدن و دراز کشیدن** \n **عوامل تخفیف دهنده ی آن: \n آنتی اسید ها و گاهی آروغ زدن**")
                        print()
                        print("از اوموپرازول استفاده کنید \n و اگر شدید شد، پنتاپرازول تزریق کنید.")
                    elif Cough == 2:
                        print("شما به احتمال 35% به بیماری رفلاکس معده به مری مبتلا هستید. \n ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                        print()
                        print("زمان بندی آن: متغیر \n **عوامل تشدید کننده ی آن: \n معده ی غذایی بزگ، خم شدن و دراز کشیدن** \n **عوامل تخفیف دهنده ی آن: \n آنتی اسید ها و گاهی آروغ زدن**")
                        print()
                        print("از اوموپرازول استفاده کنید \n و اگر شدید شد، پنتاپرازول تزریق کنید.")
                elif IntensityBackPainCheck == 2:
                    Cough = int(input("آیا سرفه می کنید؟ \n 1.بله \n 2.خیر\n"))
                    if Cough == 1:
                        print("شما به احتمال 60% به بیماری رفلاکس معده به مری مبتلا هستید. \n ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                        print()
                        print("زمان بندی آن: متغیر \n **عوامل تشدید کننده ی آن: \n معده ی غذایی بزگ، خم شدن و دراز کشیدن** \n **عوامل تخفیف دهنده ی آن: \n آنتی اسید ها و گاهی آروغ زدن**")
                        print()
                        print("از اوموپرازول استفاده کنید \n و اگر شدید شد، پنتاپرازول تزریق کنید.")
                    elif Cough == 2:
                        print("شما به احتمال 50% به بیماری رفلاکس معده به مری مبتلا هستید. \n ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                        print()
                        print("زمان بندی آن: متغیر \n **عوامل تشدید کننده ی آن: \n معده ی غذایی بزگ، خم شدن و دراز کشیدن** \n **عوامل تخفیف دهنده ی آن: \n آنتی اسید ها و گاهی آروغ زدن**")
                        print()
                        print("از اوموپرازول استفاده کنید \n و اگر شدید شد، پنتاپرازول تزریق کنید.")
            
            elif QualityBackPainCheck == 2:
                IntensityBackPainCheck = int(input("شدت درد شما به چه صورت است؟ \n 1.متوسط \n 2.شدید\n"))
                if IntensityBackPainCheck == 1:
                    Cough = int(input("آیا سرفه می کنید؟ \n 1.بله \n 2.خیر\n"))
                    if Cough == 1:
                        print("شما به احتمال 45% به بیماری رفلاکس معده به مری مبتلا هستید. \n ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                        print()
                        print("زمان بندی آن: متغیر \n **عوامل تشدید کننده ی آن: \n معده ی غذایی بزگ، خم شدن و دراز کشیدن** \n **عوامل تخفیف دهنده ی آن: \n آنتی اسید ها و گاهی آروغ زدن**")
                        print()
                        print("از اوموپرازول استفاده کنید \n و اگر شدید شد، پنتاپرازول تزریق کنید.")
                    elif Cough == 2:
                        print("شما به احتمال 40% به بیماری رفلاکس معده به مری مبتلا هستید. \n ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                        print()
                        print("زمان بندی آن: متغیر \n **عوامل تشدید کننده ی آن: \n معده ی غذایی بزگ، خم شدن و دراز کشیدن** \n **عوامل تخفیف دهنده ی آن: \n آنتی اسید ها و گاهی آروغ زدن**")
                        print()
                        print("از اوموپرازول استفاده کنید \n و اگر شدید شد، پنتاپرازول تزریق کنید.")
                elif IntensityBackPainCheck == 2:
                    Cough = int(input("آیا سرفه می کنید؟ \n 1.بله \n 2.خیر\n"))
                    if Cough == 1:
                        print("شما به احتمال 65% به بیماری رفلاکس معده به مری مبتلا هستید. \n ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                        print()
                        print("زمان بندی آن: متغیر \n **عوامل تشدید کننده ی آن: \n معده ی غذایی بزگ، خم شدن و دراز کشیدن** \n **عوامل تخفیف دهنده ی آن: \n آنتی اسید ها و گاهی آروغ زدن**")
                        print()
                        print("از اوموپرازول استفاده کنید \n و اگر شدید شد، پنتاپرازول تزریق کنید.")
                    elif Cough == 2:
                        print("شما به احتمال 55% به بیماری رفلاکس معده به مری مبتلا هستید. \n ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                        print()
                        print("زمان بندی آن: متغیر \n **عوامل تشدید کننده ی آن: \n معده ی غذایی بزگ، خم شدن و دراز کشیدن** \n **عوامل تخفیف دهنده ی آن: \n آنتی اسید ها و گاهی آروغ زدن**")
                        print()
                        print("از اوموپرازول استفاده کنید \n و اگر شدید شد، پنتاپرازول تزریق کنید.")     
         
            elif QualityBackPainCheck == 3:
                print("متاسفیم، اطلاعات کافی برای تشخیص مشکل شما در دسترس نیست. \n لطفا به پزشک خود مراجعه کنید.")
         
        elif BackPainCheck == 3:
            print("متاسفیم، اطلاعات کافی برای تشخیص مشکل شما در دسترس نیست. \n لطفا به پزشک خود مراجعه کنید.")
     
          
              
                
           
                
         
    elif AreaOfThePain == 3:
        QualityCheck = int(input("آیا کیفیت درد شما تیز، مبهم و بی تاب کننده است؟ \n 1.بله \n 2.خیر \n"))
        if QualityCheck == 1:
            SensitivityCheck = int(input("آیا شما به لمس موضعی حسایت دارید؟ \n 1.بله \n 2.خیر \n"))
            if SensitivityCheck == 1:
                print("شما با احتمال 70%-80% به درد دیواره ی قفسه سینه مبتلا هستید. \n ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                print()
                print("زمان بندی آن: ساعت ها تا روز ها \n **عوامل تشدید کننده ی آن: \n سرفه، حرکات قفسه سینه و دست ها**")
                print()
                print("اگر دیواره ی قفسه سینه ی شما شکسته باشد؛ \n باید صبر و استراحت کنید. \n اگر نشکسته باشد؛ باید صبر کنید تا کبودی رفع شود.")
             
            elif SensitivityCheck == 2:
                print("شما با احتمال 60%-50% به درد دیواره ی قفسه سینه مبتلا هستید. \n ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                print()
                print("زمان بندی آن: ساعت ها تا روز ها \n **عوامل تشدید کننده ی آن: \n سرفه، حرکات قفسه سینه و دست ها**")
                print()
                print("اگر دیواره ی قفسه سینه ی شما شکسته باشد؛ \n باید صبر و استراحت کنید. \n اگر نشکسته باشد؛ باید صبر کنید تا کبودی رفع شود.")
                
        elif QualityCheck == 2:
            print("متاسفیم، اطلاعات کافی برای تشخیص مشکل شما در دسترس نیست. \n لطفا به پزشک خود مراجعه کنید.")
          
    elif AreaOfThePain == 2:
        PainInTheFrontCheck = int(input("آیا روی قدام سینه ی خود، درد احساس می کنید؟ \n 1.بله \n 2.خیر \n"))
        if PainInTheFrontCheck == 2:
            QualityFrontCheck = int(input("آیا کیفیت درد شما تیز، مبهم و بی تاب کننده است؟ \n 1.بله \n 2.خیر \n"))
            if QualityFrontCheck == 1:
                SensitivityFrontCheck = int(input("آیا شما به لمس موضعی حسایت دارید؟ \n 1.بله \n 2.خیر \n"))
                if SensitivityFrontCheck == 1:
                    print("شما با احتمال 70%-60% به درد دیواره ی قفسه سینه مبتلا هستید. \n ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                    print()
                    print("زمان بندی آن: ساعت ها تا روز ها \n **عوامل تشدید کننده ی آن: \n سرفه، حرکات قفسه سینه و دست ها**")
                    print()
                    print("اگر دیواره ی قفسه سینه ی شما شکسته باشد؛ \n باید صبر و استراحت کنید. \n اگر نشکسته باشد؛ باید صبر کنید تا کبودی رفع شود.")
                 
                elif SensitivityFrontCheck == 2:
                    print("شما با احتمال 60%-50% به درد دیواره ی قفسه سینه مبتلا هستید. \n ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                    print()
                    print("زمان بندی آن: ساعت ها تا روز ها \n **عوامل تشدید کننده ی آن: \n سرفه، حرکات قفسه سینه و دست ها**")
                    print()
                    print("اگر دیواره ی قفسه سینه ی شما شکسته باشد؛ \n باید صبر و استراحت کنید. \n اگر نشکسته باشد؛ باید صبر کنید تا کبودی رفع شود.")
            
            elif QualityFrontCheck == 2:
                print("متاسفیم، اطلاعات کافی برای تشخیص مشکل شما در دسترس نیست. \n لطفا به پزشک خود مراجعه کنید.")
                
        elif PainInTheFrontCheck == 1:
            QualityFrontCheck2 = int(input("آیا کیفیت درد شما تیز، مبهم و بی تاب کننده است؟ \n 1.بله \n 2.خیر \n"))
            if QualityFrontCheck2 == 1:
                print("حال باید بفهمیم شما چه علائم همراهی دارید.")
                print(" 1.تنگی نفس \n 2.تپش قلب ضعیف \n 3.اضطراب \n 4.گزینه های دیگر")
                print()
                associated_symptoms=input("کدام یک ار علائم همراه را دارید؟ \n شما میتوانید چند گزینه هم انتخاب کنید. /n فقط کافی است بین اعداد  ,  قرار دهید.\n")
                print()
                associated_symptoms=set(map(int,associated_symptoms.split(",")))
                if associated_symptoms == {1}:
                    print("شما به احتمال 40% به اضطراب و اخلالات روانی مبتلا هستید. \n  ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                    print()
                    print("زمان بندی آن: ساعت ها تا روز ها \n **عوامل تشدید کننده ی آن: فعالیت و استرس عاطفی**")
                    print()
                    print("به روان پزشک مراجعه کرده و در صورت نیاز داروی اعصاب مصرف کنید.")
                elif associated_symptoms == {2}:
                    print("شما به احتمال 35% به اضطراب و اخلالات روانی مبتلا هستید. \n  ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                    print()
                    print("زمان بندی آن: ساعت ها تا روز ها \n **عوامل تشدید کننده ی آن: فعالیت و استرس عاطفی**")
                    print()
                    print("به روان پزشک مراجعه کرده و در صورت نیاز داروی اعصاب مصرف کنید.")
                elif associated_symptoms == {3}:
                    print("شما به احتمال 50% به اضطراب و اخلالات روانی مبتلا هستید. \n  ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                    print()
                    print("زمان بندی آن: ساعت ها تا روز ها \n **عوامل تشدید کننده ی آن: فعالیت و استرس عاطفی**")
                    print()
                    print("به روان پزشک مراجعه کرده و در صورت نیاز داروی اعصاب مصرف کنید.")
                elif associated_symptoms == {1,2}:
                    print("شما به احتمال 45% به اضطراب و اخلالات روانی مبتلا هستید. \n  ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                    print()
                    print("زمان بندی آن: ساعت ها تا روز ها \n **عوامل تشدید کننده ی آن: فعالیت و استرس عاطفی**")
                    print()
                    print("به روان پزشک مراجعه کرده و در صورت نیاز داروی اعصاب مصرف کنید.")
                elif associated_symptoms == {1,3}:
                    print("شما به احتمال 55% به اضطراب و اخلالات روانی مبتلا هستید. \n  ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                    print()
                    print("زمان بندی آن: ساعت ها تا روز ها \n **عوامل تشدید کننده ی آن: فعالیت و استرس عاطفی**")
                    print()
                    print("به روان پزشک مراجعه کرده و در صورت نیاز داروی اعصاب مصرف کنید.")
                elif associated_symptoms == {2,3}:
                    print("شما به احتمال 50% به اضطراب و اخلالات روانی مبتلا هستید. \n  ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                    print()
                    print("زمان بندی آن: ساعت ها تا روز ها \n **عوامل تشدید کننده ی آن: فعالیت و استرس عاطفی**")
                    print()
                    print("به روان پزشک مراجعه کرده و در صورت نیاز داروی اعصاب مصرف کنید.")
                elif associated_symptoms == {1,2,3}:
                    print("شما به احتمال 60%-70% به اضطراب و اخلالات روانی مبتلا هستید. \n  ولی برای نتایج دقیق تر، پیشنهاد می شود به پزشک مراجعه کنید.")
                    print()
                    print("زمان بندی آن: ساعت ها تا روز ها \n **عوامل تشدید کننده ی آن: فعالیت و استرس عاطفی**")
                    print()
                    print("به روان پزشک مراجعه کرده و در صورت نیاز داروی اعصاب مصرف کنید.")
                elif associated_symptoms == {4}:
                    print("متاسفیم، اطلاعات کافی برای تشخیص مشکل شما در دسترس نیست. \n لطفا به پزشک خود مراجعه کنید.")
                    
                     
                     
            elif QualityFrontCheck2 == 2:
                print("متاسفیم، اطلاعات کافی برای تشخیص مشکل شما در دسترس نیست. \n لطفا به پزشک خود مراجعه کنید.")
                
                
    
##################################################    
elif A == 3:
    print("شما سرفه دارید.")
     #باید بفهیم دچار چه نوع سرفه ای است.
    print()
    print("اکنون نیاز است تا بفهمم دچار چه نوع سرفه ای هستید. از بین عوامل زیر انتخاب کنید.")
    print("1=سرفه خشک\n2=خلط موکوئیدی یا همان ژلاتینی\n3=خلط چرکی آغشته به خون\n4=خلط چرکی بدون خون\n5=خلط چرکی کاملا خونی\n6=سرفه مزمن خصوصا در شب\n7=سرفه متغیر در مکان ها و زمان خاص")
    print()
    cough=input("کدام یک از سرفه ها را دارید؟می توانید چند مورد را هم انتخاب کنید فقط کافی است بین اعداد  ,  قرار دهید")
    #از split استفاده می کنیم برای اینکه اون string بالا را اعدادش را و ',' از هم جدا می کنه
    # از تابع map اینجا استفاده می کنیم برای اینکه تمامی اطلاعات ورودی را به دیتا های عددی تبدیل کنیم.
    cough=set(map(int,cough.split(",")))
    print()
     #حالا باید بفهیم دچار چه علائم همراهی است.
    print("اکنون نیاز است تا بفهمم دچار چه علائم همراهی هستید. از بین عوامل زیر انتخاب کنید.")
    print("1=تب\n2=سردرد\n3=تنگی نفس\n4=درد قفسه سینه\n5=لرز\n6=ترشح پشت بینی\n7=بی اشتهایی\n8=کاهش وزن\n9=خستگی\n10=تعق شبانه\n11=در مواجه با محرک سرفه ایجاد می شود\n12=عفونت\n13=سابقه الرژی\n15=خس خس\n16=فقط سرفه بدون علائم همراه")
    print()
    associated_symptoms=input("کدام یک از علائم همراه را دارید؟می توانید چند مورد را هم انتخاب کنید فقط کافی است بین اعداد  ,  قرار دهید.")
    associated_symptoms=set(map(int,associated_symptoms.split(",")))
    #عفونت ریه ویروسی
    #سرفه خشک
    if cough=={1} and associated_symptoms=={1}:
        print("شما به احتمال 30 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={2}:
        print("شما به احتمال 25 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={3}:
        print("شما به احتمال 40 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={1,2}:
        print("شما به احتمال 40 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={1,3}:
        print("شما به احتمال 50 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={2,3}:
        print("شما به احتمال 35 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={1,2,3}:
        print("شما به احتمال 70-60 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={16}:
        print("شما به احتمال 20 درصد به عفونت ریه ویروسی مبتلا شده اید.")

    # خلط موکوئیدی
    elif cough=={2} and associated_symptoms=={1}:
        print("شما به احتمال 20 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={2}:
        print("شما به احتمال 15 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={3}:
        print("شما به احتمال 30 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={1,2}:
        print("شما به احتمال 30 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={1,3}:
        print("شما به احتمال 40 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={2,3}:
        print("شما به احتمال 25 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={1,2,3}:
        print("شما به احتمال 60-50 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={16}:
        print("شما به احتمال 35 درصد به عفونت ریه ویروسی مبتلا شده اید.")

    # خلط چرکی
    elif cough=={4} and associated_symptoms=={1}:
        print("شما به احتمال 25 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={4} and associated_symptoms=={2}:
        print("شما به احتمال 20 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={4} and associated_symptoms=={3}:
        print("شما به احتمال 35 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={4} and associated_symptoms=={1,2}:
        print("شما به احتمال 35 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={4} and associated_symptoms=={1,3}:
        print("شما به احتمال 45 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={4} and associated_symptoms=={2,3}:
        print("شما به احتمال 30 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={4} and associated_symptoms=={1,2,3}:
        print("شما به احتمال 65-55 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={4} and associated_symptoms=={16}:
        print("شما به احتمال 60 درصد به عفونت ریه ویروسی مبتلا شده اید.")

    #سرفه خشک و خلط موکوئیدی
    elif cough=={1,2} and associated_symptoms=={1}:
        print("شما به احتمال 35-30 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={2}:
        print("شما به احتمال 30-25 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={3}:
        print("شما به احتمال 45-40 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={1,2}:
        print("شما به احتمال 45-40 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={1,3}:
        print("شما به احتمال 60-50 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={2,3}:
        print("شما به احتمال 40-35 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={1,2,3}:
        print("شما به احتمال 70-60 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={16}:
        print("شما به احتمال 40 درصد به عفونت ریه ویروسی مبتلا شده اید.")
   
    #سرفه خشک و خلط چرکی
    elif cough=={1,4} and associated_symptoms=={1}:
        print("شما به احتمال 40-35 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1,4} and associated_symptoms=={2}:
        print("شما به احتمال 35-30 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1,4} and associated_symptoms=={3}:
        print("شما به احتمال 50-45 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1,4} and associated_symptoms=={1,2}:
        print("شما به احتمال 55-45 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1,4} and associated_symptoms=={1,3}:
        print("شما به احتمال 45-55 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1,4} and associated_symptoms=={2,3}:
        print("شما به احتمال 50-40 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1,4} and associated_symptoms=={1,2,3}:
        print("شما به احتمال 75-65 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1,4} and associated_symptoms=={16}:
        print("شما به احتمال 55 درصد به عفونت ریه ویروسی مبتلا شده اید.")

    # خلط موکوئیدی و خلط چرکی
    elif cough=={2,4} and associated_symptoms=={1}:
        print("شما به احتمال 30-25 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={2,4} and associated_symptoms=={2}:
        print("شما به احتمال 25-20 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={2,4} and associated_symptoms=={3}:
        print("شما به احتمال 40-35 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={2,4} and associated_symptoms=={1,2}:
        print("شما به احتمال 30-35 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={2,4} and associated_symptoms=={1,3}:
        print("شما به احتمال 55-45 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={2,4} and associated_symptoms=={2,3}:
        print("شما به احتمال 40-30 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={2,4} and associated_symptoms=={1,2,3}:
        print("شما به احتمال 65-55 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={2,4} and associated_symptoms=={16}:
        print("شما به احتمال 50 درصد به عفونت ریه ویروسی مبتلا شده اید.")

    # سرفه خشک، خلط موکوئیدی و خلط چرکی
    elif cough=={1,2,4} and associated_symptoms=={1}:
        print("شما به احتمال 45-35 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1,2,4} and associated_symptoms=={2}:
        print("شما به احتمال 35-30 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1,2,4} and associated_symptoms=={3}:
        print("شما به احتمال 50-45 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1,2,4} and associated_symptoms=={1,2}:
        print("شما به احتمال 55-45 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1,2,4} and associated_symptoms=={1,3}:
        print("شما به احتمال 65-55 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1,2,4} and associated_symptoms=={2,3}:
        print("شما به احتمال 55-45 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1,2,4} and associated_symptoms=={1,2,3}:
        print("شما به احتمال 75-65 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    elif cough=={1,2,4} and associated_symptoms=={16}:
        print("شما به احتمال 65 درصد به عفونت ریه ویروسی مبتلا شده اید.")
    print("درمان پیشنهادی ما انتی ویروس ها است.اما درصد احتمال ذکر شده تقریبی است حتما برای دریافت دوز دقیق دارو و نوع انتی ویروس به پزشک مراجه کنید")
    

        
 #عفونت ریه باکتریایی
        #خلط موکوئیدی
    if cough=={2} and associated_symptoms=={1}:
         print("شما به احتمال 20 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={3}:
         print("شما به احتمال 25 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={4}:
         print("شما به احتمال 30 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={5}:
         print("شما به احتمال 15 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={1,3}:
         print("شما به احتمال 35 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={1,4}:
         print("شما به احتمال 40 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={1,5}:
         print("شما به احتمال 25 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={3,4}:
         print("شما به احتمال 35 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={3,5}:
         print("شما به احتمال 20 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={4,5}:
         print("شما به احتمال 25 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={1,3,4}:
         print("شما به احتمال 45 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={1,3,5}:
         print("شما به احتمال 30 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={3,4,5}:
         print("شما به احتمال 35 درصد به عفونت ریه باکتریایی مبتلا شده اید.")

    #خلط چرکی آغشته به خون
    elif cough=={3} and associated_symptoms=={1}:
         print("شما به احتمال 35 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={3}:
         print("شما به احتمال 40 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={4}:
         print("شما به احتمال 45 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={5}:
         print("شما به احتمال 30 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={1,3}:
         print("شما به احتمال 45 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={1,4}:
         print("شما به احتمال 50 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={1,5}:
         print("شما به احتمال 35 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={3,4}:
         print("شما به احتمال 45 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={3,5}:
         print("شما به احتمال 35 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={4,5}:
         print("شما به احتمال 40 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={1,3,4}:
         print("شما به احتمال 55 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={1,3,5}:
         print("شما به احتمال 40 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={3,4,5}:
         print("شما به احتمال 45 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={1,2,3,4}:
         print("شما به احتمال 60 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={16}:
         print("شما به احتمال 70 درصد به عفونت ریه باکتریایی مبتلا شده اید.")

    #خلط چرکی بدون خون
    elif cough=={4} and associated_symptoms=={1}:
         print("شما به احتمال 30 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={4} and associated_symptoms=={3}:
         print("شما به احتمال 35 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={4} and associated_symptoms=={4}:
         print("شما به احتمال 40 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={4} and associated_symptoms=={5}:
         print("شما به احتمال 25 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={4} and associated_symptoms=={1,3}:
         print("شما به احتمال 40 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={4} and associated_symptoms=={1,4}:
         print("شما به احتمال 45 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={4} and associated_symptoms=={1,5}:
         print("شما به احتمال 30 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={4} and associated_symptoms=={3,4}:
         print("شما به احتمال 35 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={4} and associated_symptoms=={3,5}:
         print("شما به احتمال 25 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={4} and associated_symptoms=={4,5}:
         print("شما به احتمال 35 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={4} and associated_symptoms=={1,3,4}:
         print("شما به احتمال 50 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={4} and associated_symptoms=={1,3,5}:
         print("شما به احتمال 35 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={4} and associated_symptoms=={3,4,5}:
         print("شما به احتمال 40 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={4} and associated_symptoms=={1,2,3,4}:
         print("شما به احتمال 55 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={4} and associated_symptoms=={16}:
         print("شما به احتمال 60 درصد به عفونت ریه باکتریایی مبتلا شده اید.")

    #خلط موکوئیدی و خلط چرکی آغشته به خون
    elif cough=={2,3} and associated_symptoms=={1}:
         print("شما به احتمال 40 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={3}:
         print("شما به احتمال 45 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={4}:
         print("شما به احتمال 50 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={5}:
         print("شما به احتمال 35 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={1,3}:
         print("شما به احتمال 50 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={1,4}:
         print("شما به احتمال 55 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={1,5}:
         print("شما به احتمال 40 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={3,4}:
         print("شما به احتمال 45 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={3,5}:
         print("شما به احتمال 35 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={4,5}:
         print("شما به احتمال 40 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={1,3,4}:
         print("شما به احتمال 60 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={1,3,5}:
         print("شما به احتمال 45 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={3,4,5}:
         print("شما به احتمال 50 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={1,2,3,4}:
         print("شما به احتمال 65 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={16}:
         print("شما به احتمال 75 درصد به عفونت ریه باکتریایی مبتلا شده اید.")

    #خلط موکوئیدی و خلط چرکی بدون خون
    elif cough=={2,4} and associated_symptoms=={1}:
         print("شما به احتمال 35 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,4} and associated_symptoms=={3}:
         print("شما به احتمال 40 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,4} and associated_symptoms=={4}:
         print("شما به احتمال 45 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,4} and associated_symptoms=={5}:
         print("شما به احتمال 30 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,4} and associated_symptoms=={1,3}:
         print("شما به احتمال 45 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,4} and associated_symptoms=={1,4}:
         print("شما به احتمال 50 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,4} and associated_symptoms=={1,5}:
         print("شما به احتمال 35 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,4} and associated_symptoms=={3,4}:
         print("شما به احتمال 40 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,4} and associated_symptoms=={3,5}:
         print("شما به احتمال 30 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,4} and associated_symptoms=={4,5}:
         print("شما به احتمال 35 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,4} and associated_symptoms=={1,3,4}:
         print("شما به احتمال 55 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,4} and associated_symptoms=={1,3,5}:
         print("شما به احتمال 40 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,4} and associated_symptoms=={3,4,5}:
         print("شما به احتمال 45 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,4} and associated_symptoms=={1,2,3,4}:
         print("شما به احتمال 60 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,4} and associated_symptoms=={16}:
         print("شما به احتمال 65 درصد به عفونت ریه باکتریایی مبتلا شده اید.")

    #خلط چرکی آغشته به خون و خلط چرکی بدون خون
    elif cough=={3,4} and associated_symptoms=={1}:
         print("شما به احتمال 35 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3,4} and associated_symptoms=={3}:
         print("شما به احتمال 40 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3,4} and associated_symptoms=={4}:
         print("شما به احتمال 45 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3,4} and associated_symptoms=={5}:
         print("شما به احتمال 30 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3,4} and associated_symptoms=={1,3}:
         print("شما به احتمال 45 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3,4} and associated_symptoms=={1,4}:
         print("شما به احتمال 50 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3,4} and associated_symptoms=={1,5}:
         print("شما به احتمال 35 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3,4} and associated_symptoms=={3,4}:
         print("شما به احتمال 40 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3,4} and associated_symptoms=={3,5}:
         print("شما به احتمال 30 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3,4} and associated_symptoms=={4,5}:
         print("شما به احتمال 35 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3,4} and associated_symptoms=={1,3,4}:
         print("شما به احتمال 55 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3,4} and associated_symptoms=={1,3,5}:
         print("شما به احتمال 40 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3,4} and associated_symptoms=={3,4,5}:
         print("شما به احتمال 50 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3,4} and associated_symptoms=={1,2,3,4}:
         print("شما به احتمال 60 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={3,4} and associated_symptoms=={16}:
         print("شما به احتمال 68 درصد به عفونت ریه باکتریایی مبتلا شده اید.")

    #خلط موکوئیدی و چرکی آغشته به خون و خلط چرکی بدون خون
    elif cough=={2,3,4} and associated_symptoms=={1}:
         print("شما به احتمال 40 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3,4} and associated_symptoms=={3}:
         print("شما به احتمال 45 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3,4} and associated_symptoms=={4}:
         print("شما به احتمال 50 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3,4} and associated_symptoms=={5}:
         print("شما به احتمال 35 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3,4} and associated_symptoms=={1,3}:
         print("شما به احتمال 50 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3,4} and associated_symptoms=={1,4}:
         print("شما به احتمال 55 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3,4} and associated_symptoms=={1,5}:
         print("شما به احتمال 40 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3,4} and associated_symptoms=={3,4}:
         print("شما به احتمال 45 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3,4} and associated_symptoms=={3,5}:
         print("شما به احتمال 35 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3,4} and associated_symptoms=={4,5}:
         print("شما به احتمال 40 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3,4} and associated_symptoms=={1,3,4}:
         print("شما به احتمال 60 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3,4} and associated_symptoms=={1,3,5}:
         print("شما به احتمال 45 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3,4} and associated_symptoms=={3,4,5}:
         print("شما به احتمال 50 درصد به عفونت ریه باکتریایی مبتلا شده اید.")     
    elif cough=={2,3,4} and associated_symptoms=={1,2,3,4}:
         print("شما به احتمال 65 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    elif cough=={2,3,4} and associated_symptoms=={16}:
         print("شما به احتمال 80 درصد به عفونت ریه باکتریایی مبتلا شده اید.")
    print("درمان پیشنهادی ما انتی بیوتیک‌ها است.اما درصد احتمال ذکر شده تقریبی است حتما برای دریافت دوز دقیق دارو و نوع انتی بیوتیک به پزشک مراجه کنید")

     #سینوزیت ویروسی یاسینوزیت باکتریایی و یا آلرژی)ترشح پشت بینی(
    #خلط موکوئیدی
    if cough=={2} and associated_symptoms=={6}:
         print("شما به احتمال 30 درصد شما سینوزیت ویروسی دارید و احتمال 25 درصد شما سینوزیت باکتریایی دارید احتمال 20 درصد دچار آلرژی شده اید.")
    
    #خلط چرکی بدون خون
    elif cough=={4} and associated_symptoms=={6}:
         print("شما به احتمال 25 درصد شما سینوزیت ویروسی دارید و احتمال 20 درصد شما سینوزیت باکتریایی دارید احتمال 15 درصد دچار آلرژی شده اید.")

    #سرفه مزمن
    elif cough=={6} and associated_symptoms=={6}:
         print("شما به احتمال 20 درصد شما سینوزیت ویروسی دارید و احتمال 15 درصد شما سینوزیت باکتریایی دارید احتمال 10 درصد دچار آلرژی شده اید.")
  
    #خلط موکوئیدی و خلط چرکی بدون خون
    elif cough=={2,4} and associated_symptoms=={6}:
         print("شما به احتمال 35 درصد شما سینوزیت ویروسی دارید و احتمال 30 درصد شما سینوزیت باکتریایی دارید احتمال 25 درصد دچار آلرژی شده اید.")
 
    #خلط موکوئیدی و سرفه مزمن
    elif cough=={2,6} and associated_symptoms=={6}:
         print("شما به احتمال 25 درصد شما سینوزیت ویروسی دارید و احتمال 20 درصد شما سینوزیت باکتریایی دارید احتمال 20 درصد دچار آلرژی شده اید.")
  
    #خلط چرکی بدون خون و سرفه مزمن
    elif cough=={4,6} and associated_symptoms=={6}:
         print("شما به احتمال 35 درصد شما سینوزیت ویروسی دارید و احتمال 25 درصد شما سینوزیت باکتریایی دارید احتمال 20 درصد دچار آلرژی شده اید.")
  
    #خلط موکوئیدی و خلط چرکی بدون خون و سرفه مزمن
    elif cough=={2,4,6} and associated_symptoms=={6}:
         print("شما به احتمال 40 درصد شما سینوزیت ویروسی دارید و احتمال 35 درصد شما سینوزیت باکتریایی دارید احتمال 30 درصد دچار آلرژی شده اید.")

#بدون علائم همراه
    elif cough=={2} and associated_symptoms=={16}:
         print("شما به احتمال 50 درصد شما سینوزیت ویروسی دارید و احتمال 20 درصد شما سینوزیت باکتریایی دارید احتمال 40 درصد دچار آلرژی شده اید.")
    elif cough=={4} and associated_symptoms=={16}:
         print("شما به احتمال 30 درصد شما سینوزیت ویروسی دارید و احتمال 70 درصد شما سینوزیت باکتریایی دارید احتمال 10 درصد دچار آلرژی شده اید.")
    elif cough=={6} and associated_symptoms=={16}:
         print("شما به احتمال 20 درصد شما سینوزیت ویروسی دارید و احتمال 30 درصد شما سینوزیت باکتریایی دارید احتمال 50 درصد دچار آلرژی شده اید.")
    elif cough=={2,4} and associated_symptoms=={16}:
         print("شما به احتمال 40 درصد شما سینوزیت ویروسی دارید و احتمال 60 درصد شما سینوزیت باکتریایی دارید احتمال 25 درصد دچار آلرژی شده اید.")
    elif cough=={2,6} and associated_symptoms=={16}:
          print("شما به احتمال 35 درصد شما سینوزیت ویروسی دارید و احتمال 25 درصد شما سینوزیت باکتریایی دارید احتمال 45 درصد دچار آلرژی شده اید.")
    elif cough=={4,6} and associated_symptoms=={16}:
          print("شما به احتمال 30 درصد شما سینوزیت ویروسی دارید و احتمال 70 درصد شما سینوزیت باکتریایی دارید احتمال 20 درصد دچار آلرژی شده اید.")
    elif cough=={2,4,6} and associated_symptoms=={16}:
          print("شما به احتمال 25 درصد شما سینوزیت ویروسی دارید و احتمال 75 درصد شما سینوزیت باکتریایی دارید احتمال 30 درصد دچار آلرژی شده اید.")
    print("درمان پیشنهادی ما، اگر ویروسی باشد ضد التهاب مثل استامینوفن و اگر عامل باکتریایی باشد نیاز به انتی بیوتیک ها دارید و اگر الرژیک باشد نیاز به آنتی هیستامین است.درصد احتمال ذکر شده تقریبی است حتما برای دریافت دوز دقیق دارو و نوع انتی بیوتیک یا دارو صد التهاب به پزشک مراجه کنید")
        
            #سل ریوی
    #سرفه خشک
    if cough=={1} and associated_symptoms=={1}:
        print("شما به احتمال 20 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={7}:
        print("شما به احتمال 15 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={8}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={9}:
        print("شما به احتمال 20 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={10}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={1,7}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={1,8}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={1,9}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={1,10}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={7,8}:
        print("شما به احتمال 20 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={7,9}:
        print("شما به احتمال 15 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={7,10}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={8,9}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={8,10}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={9,10}:
        print("شما به احتمال 20 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={1,7,8}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={1,7,9}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={1,7,10}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={1,8,9}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={1,8,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={1,9,10}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={7,8,9}:
        print("شما به احتمال 20 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={7,8,10}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={7,9,10}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={8,9,10}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={1,7,8,9}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={1,7,8,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={1,7,9,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={1,8,9,10}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={7,8,9,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1} and associated_symptoms=={1,7,8,9,10}:
        print("شما به احتمال 60 درصد به سل ریوی مبتلا شده اید.")

    #خلط موکوئیدی
    elif cough=={2} and associated_symptoms=={1}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={7}:
        print("شما به احتمال 20 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={8}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={9}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={10}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={1,7}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={1,8}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={1,9}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={1,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={7,8}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={7,9}:
        print("شما به احتمال 20 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={7,10}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={8,9}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={8,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={9,10}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={1,7,8}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={1,7,9}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={1,7,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={1,8,9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={1,8,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={1,9,10}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={7,8,9}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={7,8,10}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={7,9,10}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={8,9,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={1,7,8,9}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={1,7,8,10}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={1,7,9,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={1,8,9,10}:
        print("شما به احتمال 60 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={7,8,9,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={1,7,8,9,10}:
        print("شما به احتمال 65 درصد به سل ریوی مبتلا شده اید.")

    #خلط چرکی اغشته به خون
    elif cough=={3} and associated_symptoms=={1}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={7}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={8}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={9}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={1,7}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={1,8}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={1,9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={1,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={7,8}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={7,9}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={7,10}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={8,9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={8,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={9,10}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={1,7,8}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={1,7,9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={1,7,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={1,8,9}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={1,8,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={1,9,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={7,8,9}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={7,8,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={7,9,10}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={8,9,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={1,7,8,9}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={1,7,8,10}:
        print("شما به احتمال 60 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={1,7,9,10}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={1,8,9,10}:
        print("شما به احتمال 65 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={7,8,9,10}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={1,7,8,9,10}:
        print("شما به احتمال 70 درصد به سل ریوی مبتلا شده اید.")

    #خلط چرکی کاملا خونی
    elif cough=={5} and associated_symptoms=={1}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={7}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={8}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={1,7}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={1,8}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={1,9}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={1,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={7,8}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={7,9}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={7,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={8,9}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={8,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={9,10}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={1,7,8}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={1,7,9}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={1,7,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={1,8,9}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={1,8,10}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={1,9,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={7,8,9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={7,8,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={7,9,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={8,9,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={1,7,8,9}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={1,7,8,10}:
        print("شما به احتمال 65 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={1,7,9,10}:
        print("شما به احتمال 60 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={1,8,9,10}:
        print("شما به احتمال 70 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={7,8,9,10}:
        print("شما به احتمال 60 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={1,7,8,9,10}:
        print("شما به احتمال 75 درصد به سل ریوی مبتلا شده اید.")

    #سرفه خشک و خلط موکوئیدی
    elif cough=={1,2} and associated_symptoms=={1}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={7}:
        print("شما به احتمال 20 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={8}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={9}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={10}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={1,7}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={1,8}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={1,9}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={1,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={7,8}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={7,9}:
        print("شما به احتمال 20 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={7,10}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={8,9}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={8,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={9,10}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={1,7,8}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={1,7,9}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={1,7,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={1,8,9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={1,8,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={1,9,10}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={7,8,9}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={7,8,10}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={7,9,10}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={8,9,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={1,7,8,9}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={1,7,8,10}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={1,7,9,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={1,8,9,10}:
        print("شما به احتمال 60 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={7,8,9,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={1,7,8,9,10}:
        print("شما به احتمال 65 درصد به سل ریوی مبتلا شده اید.")

    #سرفه خشک و خلط چرکی آغشته به خون
    elif cough=={1,3} and associated_symptoms=={1}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={7}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={8}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={9}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={1,7}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={1,8}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={1,9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={1,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={7,8}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={7,9}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={7,10}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={8,9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={8,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={9,10}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={1,7,8}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={1,7,9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={1,7,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={1,8,9}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={1,8,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={1,9,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={7,8,9}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={7,8,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={7,9,10}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={8,9,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={1,7,8,9}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={1,7,8,10}:
        print("شما به احتمال 60 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={1,7,9,10}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={1,8,9,10}:
        print("شما به احتمال 65 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={7,8,9,10}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={1,7,8,9,10}:
        print("شما به احتمال 70 درصد به سل ریوی مبتلا شده اید.")

    #سرفه خشک و خلط چرکی کاملاً خونی
    elif cough=={1,5} and associated_symptoms=={1}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={7}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={8}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={1,7}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={1,8}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={1,9}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={1,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={7,8}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={7,9}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={7,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={8,9}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={8,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={9,10}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={1,7,8}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={1,7,9}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={1,7,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={1,8,9}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={1,8,10}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={1,9,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={7,8,9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={7,8,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={7,9,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={8,9,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={1,7,8,9}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={1,7,8,10}:
        print("شما به احتمال 65 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={1,7,9,10}:
        print("شما به احتمال 60 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={1,8,9,10}:
        print("شما به احتمال 70 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={7,8,9,10}:
        print("شما به احتمال 60 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={1,7,8,9,10}:
        print("شما به احتمال 75 درصد به سل ریوی مبتلا شده اید.")
 
    #خلط موکوئیدی و خلط چرکی آغشته به خون
    elif cough=={2,3} and associated_symptoms=={1}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={7}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={8}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={9}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={1,7}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={1,8}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={1,9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={1,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={7,8}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={7,9}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={7,10}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={8,9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={8,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={9,10}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={1,7,8}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={1,7,9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={1,7,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={1,8,9}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={1,8,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={1,9,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={7,8,9}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={7,8,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={7,9,10}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={8,9,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={1,7,8,9}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={1,7,8,10}:
        print("شما به احتمال 60 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={1,7,9,10}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={1,8,9,10}:
        print("شما به احتمال 65 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={7,8,9,10}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={1,7,8,9,10}:
        print("شما به احتمال 70 درصد به سل ریوی مبتلا شده اید.")

    #خلط موکوئیدی و خلط چرکی کاملاًخونی
    elif cough=={2,5} and associated_symptoms=={1}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={7}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={8}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={1,7}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={1,8}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={1,9}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={1,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={7,8}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={7,9}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={7,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={8,9}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={8,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={9,10}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={1,7,8}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={1,7,9}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={1,7,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={1,8,9}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={1,8,10}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={1,9,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={7,8,9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={7,8,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={7,9,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={8,9,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={1,7,8,9}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={1,7,8,10}:
        print("شما به احتمال 65 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={1,7,9,10}:
        print("شما به احتمال 60 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={1,8,9,10}:
        print("شما به احتمال 70 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={7,8,9,10}:
        print("شما به احتمال 60 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={1,7,8,9,10}:
        print("شما به احتمال 75 درصد به سل ریوی مبتلا شده اید.")

    #خلط چرکی اغشته به خون و خلط چرکی کاملاًخونی
    elif cough=={3,5} and associated_symptoms=={1}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={7}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={8}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={9}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={1,7}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={1,8}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={1,9}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={1,10}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={7,8}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={7,9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={7,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={8,9}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={8,10}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={9,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={1,7,8}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={1,7,9}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={1,7,10}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={1,8,9}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={1,8,10}:
        print("شما به احتمال 60 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={1,9,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={7,8,9}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={7,8,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={7,9,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={8,9,10}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={1,7,8,9}:
        print("شما به احتمال 60 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={1,7,8,10}:
        print("شما به احتمال 70 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={1,7,9,10}:
        print("شما به احتمال 65 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={1,8,9,10}:
        print("شما به احتمال 75 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={7,8,9,10}:
        print("شما به احتمال 65 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={1,7,8,9,10}:
        print("شما به احتمال 80 درصد به سل ریوی مبتلا شده اید.")

    #سرفه خشک و خلط موکوئیدی و خلط چرکی اغشته به خون
    elif cough=={1,2,3} and associated_symptoms=={1}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={7}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={8}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={9}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={1,7}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={1,8}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={1,9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={1,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={7,8}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={7,9}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={7,10}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={8,9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={8,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={9,10}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={1,7,8}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={1,7,9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={1,7,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={1,8,9}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={1,8,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={1,9,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={7,8,9}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={7,8,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={7,9,10}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={8,9,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={1,7,8,9}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={1,7,8,10}:
        print("شما به احتمال 60 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={1,7,9,10}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={1,8,9,10}:
        print("شما به احتمال 65 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={7,8,9,10}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={1,7,8,9,10}:
        print("شما به احتمال 70 درصد به سل ریوی مبتلا شده اید.")

    #سرفه خشک و خلط موکوئیدی و خلط چرکی کاملاًخونی
    elif cough=={1,2,5} and associated_symptoms=={1}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={7}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={8}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={1,7}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={1,8}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={1,9}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={1,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={7,8}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={7,9}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={7,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={8,9}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={8,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={9,10}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={1,7,8}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={1,7,9}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={1,7,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={1,8,9}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={1,8,10}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={1,9,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={7,8,9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={7,8,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={7,9,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={8,9,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={1,7,8,9}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={1,7,8,10}:
        print("شما به احتمال 65 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={1,7,9,10}:
        print("شما به احتمال 60 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={1,8,9,10}:
        print("شما به احتمال 70 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={7,8,9,10}:
        print("شما به احتمال 60 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={1,7,8,9,10}:
        print("شما به احتمال 75 درصد به سل ریوی مبتلا شده اید.")

        #خلط موکوئیدی و خلط چرکی اغشته به خون و خلط چرکی کاملاًخونی
    elif cough=={2,3,5} and associated_symptoms=={1}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={7}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={8}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={9}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={1,7}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={1,8}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={1,9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={1,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={7,8}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={7,9}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={7,10}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={8,9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={8,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={9,10}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={1,7,8}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={1,7,9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={1,7,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={1,8,9}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={1,8,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={1,9,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={7,8,9}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={7,8,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={7,9,10}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={8,9,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={1,7,8,9}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={1,7,8,10}:
        print("شما به احتمال 60 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={1,7,9,10}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={1,8,9,10}:
        print("شما به احتمال 65 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={7,8,9,10}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={1,7,8,9,10}:
        print("شما به احتمال 70 درصد به سل ریوی مبتلا شده اید.")

        #سرفه خشک وخلط موکوئیدی و خلط چرکی اغشته به خون و خلط چرکی کاملاًخونی
    elif cough=={1,2,3,5} and associated_symptoms=={1}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={7}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={8}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={1,7}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={1,8}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={1,9}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={1,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={7,8}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={7,9}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={7,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={8,9}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={8,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={9,10}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={1,7,8}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={1,7,9}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={1,7,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={1,8,9}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={1,8,10}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={1,9,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={7,8,9}:
        print("شما به احتمال 35 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={7,8,10}:
        print("شما به احتمال 45 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={7,9,10}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={8,9,10}:
        print("شما به احتمال 50 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={1,7,8,9}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={1,7,8,10}:
        print("شما به احتمال 65 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={1,7,9,10}:
        print("شما به احتمال 60 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={1,8,9,10}:
        print("شما به احتمال 70 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={7,8,9,10}:
        print("شما به احتمال 60 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={1,7,8,9,10}:
        print("شما به احتمال 75 درصد به سل ریوی مبتلا شده اید.")

        #بدون علائم همراه
    elif cough=={1} and associated_symptoms=={16}:
        print("شما به احتمال 30 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={16}:
        print("شما به احتمال 25 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={16}:
        print("شما به احتمال 80 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={16}:
        print("شما به احتمال 65 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2} and associated_symptoms=={16}:
        print("شما به احتمال 40 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,3} and associated_symptoms=={16}:
        print("شما به احتمال 70 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,5} and associated_symptoms=={16}:
        print("شما به احتمال 55 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3} and associated_symptoms=={16}:
        print("شما به احتمال 75 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,5} and associated_symptoms=={16}:
        print("شما به احتمال 60 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={16}:
        print("شما به احتمال 72 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3} and associated_symptoms=={16}:
        print("شما به احتمال 80 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,5} and associated_symptoms=={16}:
        print("شما به احتمال 65 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={2,3,5} and associated_symptoms=={16}:
        print("شما به احتمال 75 درصد به سل ریوی مبتلا شده اید.")
    elif cough=={1,2,3,5} and associated_symptoms=={16}:
        print("شما به احتمال 80 درصد به سل ریوی مبتلا شده اید.")
    print("راهکار مراجه به پزشک است.درصد احتمال ذکر شده تقریبی است حتما برای دریافت دوز دقیق دارو و نوع دارو به پزشک مراجه کنید")

    #آبسه ریه
    #خلط چرکی آغشته به خون خون
    if cough=={3} and associated_symptoms=={1}:
       print("شما به احتمال 35 درصد به آبسه ریه مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={12}:
       print("شما به احتمال 40 درصد به آبسه ریه مبتلا شده اید.")
    elif cough=={3} and associated_symptoms=={1,12}:
       print("شما به احتمال 45 درصد به آبسه ریه مبتلا شده اید.")

    #خلط چرکی بدون خون
    elif cough=={4} and associated_symptoms=={1}:
       print("شما به احتمال 30 درصد به آبسه ریه مبتلا شده اید.")
    elif cough=={4} and associated_symptoms=={12}:
       print("شما به احتمال 35 درصد به آبسه ریه مبتلا شده اید.")
    elif cough=={4} and associated_symptoms=={1,12}:
       print("شما به احتمال 40 درصد به آبسه ریه مبتلا شده اید.")

    #خلط چرکی کاملا خونی
    elif cough=={5} and associated_symptoms=={1}:
       print("شما به احتمال 40 درصد به آبسه ریه مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={12}:
       print("شما به احتمال 45 درصد به آبسه ریه مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={1,12}:
       print("شما به احتمال 50 درصد به آبسه ریه مبتلا شده اید.")

    #خلط چرکی بدون خون و خلط چرکی آغشته به خون
    elif cough=={3,4} and associated_symptoms=={1}:
       print("شما به احتمال 35 درصد به آبسه ریه مبتلا شده اید.")
    elif cough=={3,4} and associated_symptoms=={12}:
       print("شما به احتمال 40 درصد به آبسه ریه مبتلا شده اید.")
    elif cough=={3,4} and associated_symptoms=={1,12}:
       print("شما به احتمال 45 درصد به آبسه ریه مبتلا شده اید.")

    #خلط چرکی بدون خون و خلط چرکی آغشته به خون
    elif cough=={3,5} and associated_symptoms=={1}:
       print("شما به احتمال 40 درصد به آبسه ریه مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={12}:
       print("شما به احتمال 45 درصد به آبسه ریه مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={1,12}:
       print("شما به احتمال 50 درصد به آبسه ریه مبتلا شده اید.")

    #خلط  خلط چرکی بدون خون و خلط چرکی کاملا خونی
    elif cough=={3,5} and associated_symptoms=={1}:
       print("شما به احتمال 35 درصد به آبسه ریه مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={12}:
       print("شما به احتمال 40 درصد به آبسه ریه مبتلا شده اید.")
    elif cough=={3,5} and associated_symptoms=={1,12}:
       print("شما به احتمال 45 درصد به آبسه ریه مبتلا شده اید.")

    #خلط چرکی آغشته به خون و خلط چرکی کاملا خونی
    elif cough=={4,5} and associated_symptoms=={1}:
       print("شما به احتمال 45 درصد به آبسه ریه مبتلا شده اید.")
    elif cough=={4,5} and associated_symptoms=={12}:
       print("شما به احتمال 50 درصد به آبسه ریه مبتلا شده اید.")
    elif cough=={4,5} and associated_symptoms=={1,12}:
       print("شما به احتمال 55 درصد به آبسه ریه مبتلا شده اید.")

    #خلط چرکی بدون خون و خلط چرکی آغشته به خون و خلط چرکی کاملا خونی
    elif cough=={4,5} and associated_symptoms=={1}:
       print("شما به احتمال 45 درصد به آبسه ریه مبتلا شده اید.")
    elif cough=={4,5} and associated_symptoms=={12}:
       print("شما به احتمال 50 درصد به آبسه ریه مبتلا شده اید.")
    elif cough=={4,5} and associated_symptoms=={1,12}:
       print("شما به احتمال 55 درصد به آبسه ریه مبتلا شده اید.")

    #بدون علائم همراه
    elif cough=={3} and associated_symptoms=={16}:
       print("شما به احتمال 70-60 درصد به آبسه ریه مبتلا شده اید.")
    elif cough=={5} and associated_symptoms=={16}:
       print("شما به احتمال 80-70 درصد به آبسه ریه مبتلا شده اید.")
    elif cough=={4,5} and associated_symptoms=={16}:
       print("شما به احتمال 75-60 درصد به آبسه ریه مبتلا شده اید.")
    print("راهکار مراجه به پزشک است،مصرف انتی بیوتیک ها و باید برسی شود و درصورت وخیم بودن جراحی شود.درصد احتمال ذکر شده تقریبی است حتما برای معاینه پزشک مراجه کنید")

#اسم
#خلط موکوئیدی
    if cough=={2} and associated_symptoms=={3}:
       print("شما به احتمال 60 درصد به آسم مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={13}:
       print("شما به احتمال 45 درصد به آسم مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={15}:
       print("شما به احتمال 55 درصد به آسم مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={3}:
       print("شما به احتمال کمتر از 30 درصد به آسم مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={3,13}:
       print("شما به احتمال 70 درصد به آسم مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={3,15}:
       print("شما به احتمال 75 درصد به آسم مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={13,15}:
       print("شما به احتمال 60 درصد به آسم مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={1,13,15}:
       print("شما به احتمال 80 درصد به آسم مبتلا شده اید.")
    elif cough=={2} and associated_symptoms=={16}:
       print("شما به احتمال 20-10 درصد به آسم مبتلا شده اید.")
    print("راهکار درمانی این است که اول از 'اسپری سالبوتامول' استفاده شود و اگر خوب نشد در مرحله بعد از اسپری کورتون 'فلودروکورتیزون' استفاده شود.از اسپری 'سالمترول'به عنوان گشاد کننده راه هوایی هم میتوان استفاده کرد\n.درصد احتمال ذکر شده تقریبی است حتما برای معاینه پزشک مراجه کنید")

#رفلاکس معده
#سرفه مزمن در شب خصوصا
    if cough=={6} and associated_symptoms=={14}:
       print("شما به احتمال 50 درصد به رفلاکس معده مبتلا شده اید.")
    elif cough=={6} and associated_symptoms=={15}:
       print("شما به احتمال 40 درصد به رفلاکس معده مبتلا شده اید.")
    elif cough=={6} and associated_symptoms=={14,15}:
       print("شما به احتمال 60 درصد به رفلاکس معده مبتلا شده اید.")
    elif cough=={6} and associated_symptoms=={16}:
       print("شما به احتمال 30 درصد به رفلاکس معده مبتلا شده اید.")
    print("راهکار درمانی استفاده از شربت معده ها مانند شربت آلومینیوم-ام جی اس است.استفاده از اوموپرازول و اگر خیلی شدید باشد استفاده از پنتاپرازول تزریقی توصیه می شود\n .درصد احتمال ذکر شده تقریبی است حتما برای معاینه پزشک مراجه کنید")

#ذرات شیمیایی
#سرفه متغیر در زمان و مکان خاص
    if cough=={7} and associated_symptoms=={11}:
       print("شما به احتمال 60 درصد به سرفه به دلیل تماس با ذرات شیمیایی مبتلا شده اید.")
    elif cough=={7} and associated_symptoms=={16}:
       print("شما به احتمال 30 درصد به سرفه به دلیل تماس با ذرات شیمیایی مبتلا شده اید.")
    print("راهکار پیشنهادی ما استراحت کردن است و اینکه دیگر فرد با آلاینده در تماس نباشد.درصد احتمال ذکر شده تقریبی است حتما برای معاینه پزشک مراجه کنید")




#######################################################    
elif A == 4:
    print("شما کمر درد دارید.")
    
elif A == 5:
    print("شما تنگی نفس دارید.")
    
else:
    print("ابا عرض پوزش،اطلاعات این برنامه فعلا بیماری این علائم را پشتیبانی نمی کند.برنامه در حال کامل شدن است.")
    
print("\nصرفا این برانامه برای تشخیص اولیه بیماری است،لطفا برای تشخیص دقیق و انجام آزمایشات تکمیلی به پزشک مراجعه کنید وبا مشورت پزشک دارو مصرف کنید.\nبا تشکر از شما\nگروه برنامه نویسی ساریس")
#پایان 403/10/14




