age = int(input("چند سال دارید؟"))
gender = int(input("جنسیت خود را وارد کنید.اگر خانم هستید عدد 1 و اگر آقا هستید عدد 2 را وارد کنید."))
print("سلام،ما در این برنامه می خواهیم تا تشخیص اولیه از بیماری شما داشته باشیم و به شما راهکار پیشنهاد بدهیم.")
print()
print("این برنامه در حال حاضر روی 5 علامت اصلی بیماری ها کار می کند:")
main_symptoms = ("درد شکم", "درد قفسه سینه", "سرفه", "درد کمر", "تنگی نفس")

print("1.درد شکم\n2.درد قفسه سینه\n3.سرفه\n4.درد کمر\n5.تنگی نفس")
A = int(input("لطفا به من بگو کدام یک از علامت های اصلی زیر را داری؟ "))

if A == 1:
    print("شما شکم درد دارید.")
    
elif A == 2:
    print("شما درد قفسه سینه دارید.")
    
elif A == 3:
    print("شما سرفه دارید.")
    
elif A == 4:
    print("شما کمر درد دارید.")
    print()
    print("اکنون نیاز است تا بفهمم دچار چه علائم همراهی هستید. از بین عوامل زیر انتخاب کنید.")
    print("1.تندرنس عضلات پشت قفسه سینه\n2.تندرنس ستون فقرات\n3.درد به هنگام راه رفتن\n4.درد تیرکشنده زانو به سمت ساق پا\n5.بی حسی و ضعف\n6.تندرنس عضلات مجاور عصب سیاتیک\n7.تشدید درد در با عطسه، سرفه و زور زدن حین دفع\n8.ضعف و رفلکشن بیش ازحد ناحیه تحتانی حین خم شدن به جلو\n9.درد ساق پا پس از 30 ثانیه بک اکستنشن\n10.کاهش دامنه حرکت ستون فقرات\n11.درد در کل ستون فقرات\n12.درد مبهم و عمقی\n13.تندرنس موضعی مهره‌ها\n14.حرکات دردناک ستون فقرات")
    print()
    print("توجه: تندرنس به معنای حساس بودن ناحیه آسیب دیده می باشد")
    print()
    associated_symptoms = input("کدام یک از علائم همراه را دارید؟ می توانید چند مورد را هم انتخاب کنید فقط کافی است بین اعداد  ,  قرار دهید.")
    associated_symptoms = set(map(int,associated_symptoms.split(",")))
    if associated_symptoms == {1}:
        print("شما به احتمال 11.8% به درد مکانیکی کمر مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و درصورت افزایش درد، مسکن مصرف کنید. برای دریافت تشخیص و درمان دقیق به پزشک مراجعه کنید.")
    elif associated_symptoms == {2}:
        print("شما به احتمال 17.6% به درد مکانیکی کمر مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و درصورت افزایش درد، مسکن مصرف کنید. برای دریافت تشخیص و درمان دقیق به پزشک مراجعه کنید.")
    elif associated_symptoms == {3}:
        print("شما به احتمال 23.5% به درد مکانیکی کمر مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و درصورت افزایش درد، مسکن مصرف کنید. برای دریافت تشخیص و درمان دقیق به پزشک مراجعه کنید.")
    elif associated_symptoms == {1,2}:
        print("شما به احتمال 29.4% به درد مکانیکی کمر مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و درصورت افزایش درد، مسکن مصرف کنید. برای دریافت تشخیص و درمان دقیق به پزشک مراجعه کنید.")
    elif associated_symptoms == {1,3}:
        print("شما به احتمال 35.3% به درد مکانیکی کمر مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و درصورت افزایش درد، مسکن مصرف کنید. برای دریافت تشخیص و درمان دقیق به پزشک مراجعه کنید.")
    elif associated_symptoms == {2,3}:
        print("شما به احتمال 41.2% به درد مکانیکی کمر مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و درصورت افزایش درد، مسکن مصرف کنید. برای دریافت تشخیص و درمان دقیق به پزشک مراجعه کنید.")
    elif associated_symptoms == {1,2,3}:
        print("شما به احتمال 35.3% به درد مکانیکی کمر مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و درصورت افزایش درد، مسکن مصرف کنید. برای دریافت تشخیص و درمان دقیق به پزشک مراجعه کنید.")
    elif associated_symptoms == {4}:
        print("شما به احتمال 14.3% به درد سیاتیک مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و مسکن مصرف کنید. درصورت افزایش درد، برای تشخیص و درمان دقیق شامل دریافت کورتون و بررسی نیاز به جراحی به پزشک مراجعه کنید.")
    elif associated_symptoms == {5}:
        print("شما به احتمال 21.4% به درد سیاتیک مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و مسکن مصرف کنید. درصورت افزایش درد، برای تشخیص و درمان دقیق شامل دریافت کورتون و بررسی نیاز به جراحی به پزشک مراجعه کنید.")
    elif associated_symptoms == {6}:
        print("شما به احتمال 28.6% به درد سیاتیک مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و مسکن مصرف کنید. درصورت افزایش درد، برای تشخیص و درمان دقیق شامل دریافت کورتون و بررسی نیاز به جراحی به پزشک مراجعه کنید.")
    elif associated_symptoms == {7}:
        print("شما به احتمال 35.7% به درد سیاتیک مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و مسکن مصرف کنید. درصورت افزایش درد، برای تشخیص و درمان دقیق شامل دریافت کورتون و بررسی نیاز به جراحی به پزشک مراجعه کنید.")
    elif associated_symptoms == {4,5}:
        print("شما به احتمال 35.7% به درد سیاتیک مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و مسکن مصرف کنید. درصورت افزایش درد، برای تشخیص و درمان دقیق شامل دریافت کورتون و بررسی نیاز به جراحی به پزشک مراجعه کنید.")
    elif associated_symptoms == {4,6}:
        print("شما به احتمال 42.9% به درد سیاتیک مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و مسکن مصرف کنید. درصورت افزایش درد، برای تشخیص و درمان دقیق شامل دریافت کورتون و بررسی نیاز به جراحی به پزشک مراجعه کنید.")
    elif associated_symptoms == {4,7}:
        print("شما به احتمال 50% به درد سیاتیک مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و مسکن مصرف کنید. درصورت افزایش درد، برای تشخیص و درمان دقیق شامل دریافت کورتون و بررسی نیاز به جراحی به پزشک مراجعه کنید.")
    elif associated_symptoms == {5,6}:
        print("شما به احتمال 50% به درد سیاتیک مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و مسکن مصرف کنید. درصورت افزایش درد، برای تشخیص و درمان دقیق شامل دریافت کورتون و بررسی نیاز به جراحی به پزشک مراجعه کنید.")
    elif associated_symptoms == {5,7}:
        print("شما به احتمال 57.1% به درد سیاتیک مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و مسکن مصرف کنید. درصورت افزایش درد، برای تشخیص و درمان دقیق شامل دریافت کورتون و بررسی نیاز به جراحی به پزشک مراجعه کنید.")
    elif associated_symptoms == {6,7}:
        print("شما به احتمال 64.3% به درد سیاتیک مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و مسکن مصرف کنید. درصورت افزایش درد، برای تشخیص و درمان دقیق شامل دریافت کورتون و بررسی نیاز به جراحی به پزشک مراجعه کنید.")
    elif associated_symptoms == {4,5,6}:
        print("شما به احتمال 64.3% به درد سیاتیک مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و مسکن مصرف کنید. درصورت افزایش درد، برای تشخیص و درمان دقیق شامل دریافت کورتون و بررسی نیاز به جراحی به پزشک مراجعه کنید.")
    elif associated_symptoms == {4,5,7}:
        print("شما به احتمال 71.4% به درد سیاتیک مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و مسکن مصرف کنید. درصورت افزایش درد، برای تشخیص و درمان دقیق شامل دریافت کورتون و بررسی نیاز به جراحی به پزشک مراجعه کنید.")
    elif associated_symptoms == {4,6,7}:
        print("شما به احتمال 78.6% به درد سیاتیک مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و مسکن مصرف کنید. درصورت افزایش درد، برای تشخیص و درمان دقیق شامل دریافت کورتون و بررسی نیاز به جراحی به پزشک مراجعه کنید.")
    elif associated_symptoms == {5,6,7}:
        print("شما به احتمال 85.7% به درد سیاتیک مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و مسکن مصرف کنید. درصورت افزایش درد، برای تشخیص و درمان دقیق شامل دریافت کورتون و بررسی نیاز به جراحی به پزشک مراجعه کنید.")
    elif associated_symptoms == {8}:
        print("شما به احتمال 21.4% به تنگی کانال نخاعی کمر مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و از بلند کردن اجسام سنگین کنید. درصورت افزایش درد، برای تشخیص و درمان دقیق شامل دریافت کورتون و بررسی نیاز به جراحی به پزشک مراجعه کنید.")
    elif associated_symptoms == {9}:
        print("شما به احتمال 28.6% به تنگی کانال نخاعی کمر مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و از بلند کردن اجسام سنگین کنید. درصورت افزایش درد، برای تشخیص و درمان دقیق شامل دریافت کورتون و بررسی نیاز به جراحی به پزشک مراجعه کنید.")
    elif associated_symptoms == {8,9}:
        print("شما به احتمال 50% به تنگی کانال نخاعی کمر مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و از بلند کردن اجسام سنگین کنید. درصورت افزایش درد، برای تشخیص و درمان دقیق شامل دریافت کورتون و بررسی نیاز به جراحی به پزشک مراجعه کنید.")
    elif associated_symptoms == {10}:
        print("شما به احتمال 23.3% به درد مزمن به علت بیماری های رماتولوژیک مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و درصورت افزایش درد، برای تشخیص و درمان دقیق شامل دریافت کورتون و بررسی نیاز به جراحی به پزشک مراجعه کنید.")
    elif associated_symptoms == {11}:
        print("شما به احتمال 26.7% به درد مزمن به علت بیماری های رماتولوژیک مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و درصورت افزایش درد، برای تشخیص و درمان دقیق شامل دریافت کورتون و بررسی نیاز به جراحی به پزشک مراجعه کنید.")
    elif associated_symptoms == {10,11}:
        print("شما به احتمال 50% به درد مزمن به علت بیماری های رماتولوژیک مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا استراحت کنید و درصورت افزایش درد، برای تشخیص و درمان دقیق شامل دریافت کورتون و بررسی نیاز به جراحی به پزشک مراجعه کنید.")
    elif associated_symptoms == {12}:
        print("شما به احتمال 6.7% به درد ارجاعی از شکم و کمر مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا برای درمان علل زمینه‌ای به پزشک مراجعه کنید.")
    elif associated_symptoms == {13}:
        print("شما به احتمال 10% به درد ارجاعی از شکم و کمر مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا برای درمان علل زمینه‌ای به پزشک مراجعه کنید.")
    elif associated_symptoms == {14}:
        print("شما به احتمال 8% به درد ارجاعی از شکم و کمر مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا برای درمان علل زمینه‌ای به پزشک مراجعه کنید.")
    elif associated_symptoms == {12,13}:
        print("شما به احتمال 16.7% به درد ارجاعی از شکم و کمر مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا برای درمان علل زمینه‌ای به پزشک مراجعه کنید.")
    elif associated_symptoms == {12,14}:
        print("شما به احتمال 15% به درد ارجاعی از شکم و کمر مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا برای درمان علل زمینه‌ای به پزشک مراجعه کنید.")
    elif associated_symptoms == {13,14}:
        print("شما به احتمال 18.3% به درد ارجاعی از شکم و کمر مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا برای درمان علل زمینه‌ای به پزشک مراجعه کنید.")
    elif associated_symptoms == {12,13,14}:
        print("شما به احتمال 25% به درد ارجاعی از شکم و کمر مبتلا شده‌اید.")
        print("پیشنهاد می‌شود تا برای درمان علل زمینه‌ای به پزشک مراجعه کنید.")
    else:
        print("اطلاعات موحود نیست.")
    
elif A == 5:
    print("شما تنگی نفس دارید.")
    
else:
    print("اطلاعات موجود نیست.")

